using System;

namespace itschool_HW1_dergachev
{
    class Program
    {
        static void Main(string[] args)
        {
            //Не знал что написать сюда по этому вот...

            for (var i = 1; ; i++)
            {
                Console.WriteLine("^_^ - это морда номер " + i + "\n");
                //try
                //{

                //}
                //catch (Exception)
                //{
                //  Console.WriteLine("Ваш рекорд " + i);
                //}
            }
        }
    }
}

//Выше представленна попытка сделать переполнялку стека, но или я чего-то не понял или что бы мой стек
//забило нужно очень много времени ибо у меня 16гб озу, так же была попытка сделать сообщение об ошибке где было
//бы указан ваш рекорд по количеству морд влезших в стек но я не знаю как заставить работать MessageBox в консольном приложении по этому написал CW,
//буду рад получить какой-то фитбек.
//Спасибо за внимание.

